workstation/tutorials/mesh/foamyHexMesh/mixerVessel/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

cp -f system/controlDict.flow system/controlDict

rm -rf 0

runApplication createBaffles -overwrite

runApplication mergeOrSplitBaffles -split -overwrite

# Get rid of zero faced patches
runApplication createPatch -overwrite

# Copy fields after meshing to avoid the generation of unnecessary patch fields
restore0Dir

# Initialize alpha
runApplication setFields

runApplication -s main decomposePar -force

runParallel $(getApplication)

runApplication reconstructPar -noFunctionObjects

#------------------------------------------------------------------------------
